<script setup lang="ts"></script>
<template>
	<!--Card-->
	<div id="recipients" class="mt-6 rounded-xl bg-white p-8 shadow lg:mt-0">
		<table id="excursions-table" class="block w-full max-w-fit overflow-x-auto">
			<thead>
				<tr>
					<th
						class="min-w-[200px] p-2 text-start align-middle"
						data-priority="1"
					>
						Название
					</th>
					<th
						class="min-w-[500px] p-2 text-start align-middle"
						data-priority="2"
					>
						Описание
					</th>
					<th
						class="min-w-[300px] p-2 text-start align-middle"
						data-priority="3"
					>
						Изображения
					</th>
					<th
						class="min-w-[10px] p-2 text-start align-middle"
						data-priority="4"
					>
						Длительность
					</th>
					<th
						class="min-w-[50px] p-2 text-start align-middle"
						data-priority="5"
					>
						Цена (от)
					</th>
					<th
						class="min-w-[200px] p-2 text-start align-middle"
						data-priority="6"
					>
						Отель
					</th>
					<th
						class="min-w-[200px] p-2 text-start align-middle"
						data-priority="7"
					>
						Название прайса
					</th>
					<th
						class="min-w-[100px] p-2 text-start align-middle"
						data-priority="8"
					>
						Начало экскурсии
					</th>
					<th
						class="min-w-[100px] p-2 text-start align-middle"
						data-priority="9"
					>
						Город
					</th>
					<th
						class="min-w-[700px] p-2 text-start align-middle"
						data-priority="10"
					>
						В стоимость включено
					</th>
					<th
						class="min-w-[200px] p-2 text-start align-middle"
						data-priority="11"
					>
						Действия
					</th>
				</tr>
			</thead>
			<tbody>
				<tr class="border-b border-neutral-300">
					<td class="p-2 text-start align-top">
						АЛЫЕ ПАРУСА В САНКТ-ПЕТЕРБУРГЕ
					</td>
					<td class="p-2 text-start align-top">
						<span class="line-clamp-4"
							>1 День: Выезд из Орла. 2 День: Прибытие в Санкт-Петербург.
							Завтрак. Отправляемся на экскурсию “Новая туристическая география
							Петербурга”, во время которой увидим сооружения и культурные
							пространства, появившиеся в городе совсем недавно, но уже
							завоевавшие популярность у горожан и гостей города на Неве. Мы
							посетим рукотворный остров Новая Голландия - уникальный памятник
							промышленной архитектуры раннего классицизма, один из старейших,
							если даже не самый старый в России. Вместе с тем это одна из самых
							красивых туристических локаций Санкт-Петербурга, модный парк
							отдыха для горожан и гостей Северной столицы, где проходит
							множество культурных мероприятий. После прогулки по «Новой
							Голландии» отправимся в современный район города, названный
							«Петербургским Дубаем», проедем по современной городской
							скоростной магистрали – ЗСД, откуда открывается великолепный вид
							на Финский залив. Вы увидите самый высокий небоскреб в Европе,
							новую высотную доминанту города – «Лахта-центр». Расположенный
							прямо на берегу залива небоскреб стал точкой применения более 100
							инновационных инженерных и архитектурных решений, символом нового
							Петербурга, формирующим его современный ландшафт. И конечно
							полюбуемся похожим на космический корабль стадионом «Газпром
							Арена», принимавшим Кубок Чемпионов и Чемпионат мира по футболу
							2018. Обед Из новых районов города автобус привезет нас в
							современное городское пространство «Севкабельпорт» - центр
							современной культуры, живая событийная площадка, где проходят
							спектакли, концерты выставки и многое другое. У вас будет
							свободное время, чтобы прогуляться по пешеходной набережной,
							полюбоваться панорамой Финского залива и сделать прекрасные
							фотографии, а также чтобы познакомиться с гастрономической
							культурой петербургской «уличной» еды и попробовать ее на вкус в
							расположившемся здесь фудкорте. Заселение в отель после
							экскурсионной программы. 3 День: Завтрак. Отправление на
							загородную экскурсию в Петергоф. Петергоф – столица фонтанов, его
							называют русским Версалем. Такое название он получил за огромную
							водную систему, состоящую из большого количества фонтанов и
							каскадов, которые стали настоящим произведением искусства XVIII
							века. Вас ждёт экскурсия по дворцово-парковому ансамблю Нижнего
							парка и осмотр легендарных фонтанов. Петергофский комплекс
							фонтанов признан самым роскошным в Европе и мире. Обед.
							Возвращение в гостиницу 4 День: Завтрак. Выселение из гостиницы с
							вещами. Выселение из гостиницы с вещами. Отправление на загородную
							экскурсию в Павловск - город, входящем в состав Санкт-Петербурга и
							в прошлом бывшим одной из загородных резиденций российских
							императоров. Официальное летоисчисление Павловска начинается с
							1777 г., с момента, когда императрица Екатерина II дарит своему
							сыну, будущему императору Павлу I, земли на реке Славянке. Именно
							в честь него они получают название Павловского села, а затем и
							Павловска. В отличие от других загородных царских резиденций
							Павловск создается по единому плану, хотя и целой командой
							архитекторов. Великолепный дворец и живописный дворцовый парк
							становятся источником вдохновения для таких деятелей искусства,
							как Н.В.Гоголь, Ф.М.Достоевский, В.А.Жуковский, К.Брюллов,
							А.Бенуа. Экскурсия в Павловский Дворец – главную
							достопримечательность всего комплекса, бывший летний дворец Павла
							I работы архитектора Чарльза Камерона. Его белый купол видно
							практически из любой точки парка. Интерьеры и экстерьер
							Павловского дворца дополнялись на протяжении нескольких лет.
							Последним изменением стала библиотека над галереей Гонзага,
							построенная в 1822 году архитектором Карлом Росси. Коллекции
							художественных произведений и антикварных предметов собирались
							владельцами Павловска в путешествиях по Европе. Для украшения
							залов дворца заказывались картины, мебель, ткани, посуда,
							скульптуры и другие элементы декора у известных мастеров.
							Павловский дворец хранит богатые собрания произведений античного,
							западноевропейского и русского искусства. К дворцовому комплексу
							примыкает просторный пейзажный Павловский парк (площадь — 600 га),
							раскинувшийся по обоим берегам реки Славянки. С начала
							формирования усадьбы в Павловске парк представлял собой леса, где
							охотились царские особы. Постепенно территорию облагораживали и
							застраивали. Первым архитектором, создавшим проект по развитию
							парка, стал Ч. Камерон. Под его руководством лес был разбит на
							участки, была прорублена центральная просека и созданы аллеи.
							Обед. Переезд в Царское село - бывшую царскую летнюю резиденцию с
							дворцами, парками, павильонами, памятниками и скульптурами.
							Внешний осмотр Большого Екатерининского дворца. После вы посетите
							живописный Екатерининский парк, который дополняет общую картину
							величия дворцово-паркового ансамбля. Во время прогулки вы
							осмотрите садово-парковую скульптуру, пруды, мостики,
							искусственные каналы, знаменитые места, такие как Холодная баня с
							Агатовыми комнатами, "Висячий сад", Камеронова галерея, Эрмитаж,
							Грот, Концертный зал, Адмиралтейство, Нижняя и Верхняя ванны,
							Гранитная терраса, Кухня-руина, Большой каприз, Пирамида,
							Башня-руина, Китайская беседка, Турецкая баня и другие интересные
							места. Завершение экскурсионной программы. Отправление домой. 5
							День: Прибытие в Орел.</span
						>
					</td>
					<td class="p-2 text-start align-top">
						<div class="flex flex-wrap gap-2">
							<img
								src="https://dummyimage.com/50x50/6c757d/6c757d"
								alt=""
								width="50"
							/>
							<img
								src="https://dummyimage.com/50x50/6c757d/6c757d"
								alt=""
								width="50"
							/>
							<img
								src="https://dummyimage.com/50x50/6c757d/6c757d"
								alt=""
								width="50"
							/>
							<img
								src="https://dummyimage.com/50x50/6c757d/6c757d"
								alt=""
								width="50"
							/>
						</div>
					</td>
					<td class="p-2 text-center align-top">4</td>
					<td class="p-2 text-center align-top">22500 &#8381;</td>
					<td class="p-2 text-start align-top">Гостиница "Алые паруса"</td>
					<td class="p-2 text-start align-top">document.docx</td>
					<td class="p-2 text-start align-top">27.01.2022</td>
					<td class="p-2 text-start align-top">Санкт-Петербург</td>
					<td class="p-2 text-start align-top">
						<span class="line-clamp-4">
							В стоимость тура входит: * транспортное обслуживание по программе;
							* проживание в гостинице 2 ночи, номера с удобствами (гостиница
							“Алиот”/ “Ладога” или аналогичная); * питание – завтраки и обеды;
							* экскурсионное обслуживание и входные билеты по программе.
							Дополнительно оплачивается: * курортный сбор; * теплоходная
							прогулка по рекам и каналам; * ночная экскурсия по городу с
							разводом мостов; * расходы, не предусмотренные программой. При
							группе до 19 человек предоставляется микроавтобус Mercedes
							Sprinter, Ford Transit или аналог. При группе более 19 человек
							предоставляется автобус марки Mercedes, Man, Neoplan, Setra,
							Yutong или аналог. Компания «Делимир-Вояж» не имеет возможности
							влиять на задержки, связанные с пробками на дорогах, действиями и
							мероприятиями государственных органов, в том числе органов ГИБДД,
							дорожными работами, а также на любые другие задержки, находящиеся
							вне разумного контроля фирмы. В случае тяжелой дорожной ситуации
							возможны поздние приезды на экскурсионные объекты, а также
							заселение в гостиницу.
						</span>
					</td>
					<td class="p-2 text-start align-top">Редактировать, удалить</td>
				</tr>

				<tr class="border-b border-neutral-300">
					<td class="p-2 text-start align-top">
						АЛЫЕ ПАРУСА В САНКТ-ПЕТЕРБУРГЕ
					</td>
					<td class="p-2 text-start align-top">
						<span class="line-clamp-4 whitespace-pre-line"
							>1 День: Выезд из Орла. 2 День: Прибытие в Санкт-Петербург.
							Завтрак. Отправляемся на экскурсию “Новая туристическая география
							Петербурга”, во время которой увидим сооружения и культурные
							пространства, появившиеся в городе совсем недавно, но уже
							завоевавшие популярность у горожан и гостей города на Неве. Мы
							посетим рукотворный остров Новая Голландия - уникальный памятник
							промышленной архитектуры раннего классицизма, один из старейших,
							если даже не самый старый в России. Вместе с тем это одна из самых
							красивых туристических локаций Санкт-Петербурга, модный парк
							отдыха для горожан и гостей Северной столицы, где проходит
							множество культурных мероприятий. После прогулки по «Новой
							Голландии» отправимся в современный район города, названный
							«Петербургским Дубаем», проедем по современной городской
							скоростной магистрали – ЗСД, откуда открывается великолепный вид
							на Финский залив. Вы увидите самый высокий небоскреб в Европе,
							новую высотную доминанту города – «Лахта-центр». Расположенный
							прямо на берегу залива небоскреб стал точкой применения более 100
							инновационных инженерных и архитектурных решений, символом нового
							Петербурга, формирующим его современный ландшафт. И конечно
							полюбуемся похожим на космический корабль стадионом «Газпром
							Арена», принимавшим Кубок Чемпионов и Чемпионат мира по футболу
							2018. Обед Из новых районов города автобус привезет нас в
							современное городское пространство «Севкабельпорт» - центр
							современной культуры, живая событийная площадка, где проходят
							спектакли, концерты выставки и многое другое. У вас будет
							свободное время, чтобы прогуляться по пешеходной набережной,
							полюбоваться панорамой Финского залива и сделать прекрасные
							фотографии, а также чтобы познакомиться с гастрономической
							культурой петербургской «уличной» еды и попробовать ее на вкус в
							расположившемся здесь фудкорте. Заселение в отель после
							экскурсионной программы. 3 День: Завтрак. Отправление на
							загородную экскурсию в Петергоф. Петергоф – столица фонтанов, его
							называют русским Версалем. Такое название он получил за огромную
							водную систему, состоящую из большого количества фонтанов и
							каскадов, которые стали настоящим произведением искусства XVIII
							века. Вас ждёт экскурсия по дворцово-парковому ансамблю Нижнего
							парка и осмотр легендарных фонтанов. Петергофский комплекс
							фонтанов признан самым роскошным в Европе и мире. Обед.
							Возвращение в гостиницу 4 День: Завтрак. Выселение из гостиницы с
							вещами. Выселение из гостиницы с вещами. Отправление на загородную
							экскурсию в Павловск - город, входящем в состав Санкт-Петербурга и
							в прошлом бывшим одной из загородных резиденций российских
							императоров. Официальное летоисчисление Павловска начинается с
							1777 г., с момента, когда императрица Екатерина II дарит своему
							сыну, будущему императору Павлу I, земли на реке Славянке. Именно
							в честь него они получают название Павловского села, а затем и
							Павловска. В отличие от других загородных царских резиденций
							Павловск создается по единому плану, хотя и целой командой
							архитекторов. Великолепный дворец и живописный дворцовый парк
							становятся источником вдохновения для таких деятелей искусства,
							как Н.В.Гоголь, Ф.М.Достоевский, В.А.Жуковский, К.Брюллов,
							А.Бенуа. Экскурсия в Павловский Дворец – главную
							достопримечательность всего комплекса, бывший летний дворец Павла
							I работы архитектора Чарльза Камерона. Его белый купол видно
							практически из любой точки парка. Интерьеры и экстерьер
							Павловского дворца дополнялись на протяжении нескольких лет.
							Последним изменением стала библиотека над галереей Гонзага,
							построенная в 1822 году архитектором Карлом Росси. Коллекции
							художественных произведений и антикварных предметов собирались
							владельцами Павловска в путешествиях по Европе. Для украшения
							залов дворца заказывались картины, мебель, ткани, посуда,
							скульптуры и другие элементы декора у известных мастеров.
							Павловский дворец хранит богатые собрания произведений античного,
							западноевропейского и русского искусства. К дворцовому комплексу
							примыкает просторный пейзажный Павловский парк (площадь — 600 га),
							раскинувшийся по обоим берегам реки Славянки. С начала
							формирования усадьбы в Павловске парк представлял собой леса, где
							охотились царские особы. Постепенно территорию облагораживали и
							застраивали. Первым архитектором, создавшим проект по развитию
							парка, стал Ч. Камерон. Под его руководством лес был разбит на
							участки, была прорублена центральная просека и созданы аллеи.
							Обед. Переезд в Царское село - бывшую царскую летнюю резиденцию с
							дворцами, парками, павильонами, памятниками и скульптурами.
							Внешний осмотр Большого Екатерининского дворца. После вы посетите
							живописный Екатерининский парк, который дополняет общую картину
							величия дворцово-паркового ансамбля. Во время прогулки вы
							осмотрите садово-парковую скульптуру, пруды, мостики,
							искусственные каналы, знаменитые места, такие как Холодная баня с
							Агатовыми комнатами, "Висячий сад", Камеронова галерея, Эрмитаж,
							Грот, Концертный зал, Адмиралтейство, Нижняя и Верхняя ванны,
							Гранитная терраса, Кухня-руина, Большой каприз, Пирамида,
							Башня-руина, Китайская беседка, Турецкая баня и другие интересные
							места. Завершение экскурсионной программы. Отправление домой. 5
							День: Прибытие в Орел.</span
						>
					</td>
					<td class="p-2 text-start align-top">
						<div class="flex flex-wrap gap-2">
							<img
								src="https://dummyimage.com/50x50/6c757d/6c757d"
								alt=""
								width="50"
							/>
							<img
								src="https://dummyimage.com/50x50/6c757d/6c757d"
								alt=""
								width="50"
							/>
							<img
								src="https://dummyimage.com/50x50/6c757d/6c757d"
								alt=""
								width="50"
							/>
							<img
								src="https://dummyimage.com/50x50/6c757d/6c757d"
								alt=""
								width="50"
							/>
						</div>
					</td>
					<td class="p-2 text-center align-top">4</td>
					<td class="p-2 text-center align-top">22500 &#8381;</td>
					<td class="p-2 text-start align-top">Гостиница "Алые паруса"</td>
					<td class="p-2 text-start align-top">document.docx</td>
					<td class="p-2 text-start align-top">27.01.2022</td>
					<td class="p-2 text-start align-top">Санкт-Петербург</td>
					<td class="p-2 text-start align-top">
						<span class="line-clamp-4 whitespace-pre-line">
							В стоимость тура входит: * транспортное обслуживание по программе;
							* проживание в гостинице 2 ночи, номера с удобствами (гостиница
							“Алиот”/ “Ладога” или аналогичная); * питание – завтраки и обеды;
							* экскурсионное обслуживание и входные билеты по программе.
							Дополнительно оплачивается: * курортный сбор; * теплоходная
							прогулка по рекам и каналам; * ночная экскурсия по городу с
							разводом мостов; * расходы, не предусмотренные программой. При
							группе до 19 человек предоставляется микроавтобус Mercedes
							Sprinter, Ford Transit или аналог. При группе более 19 человек
							предоставляется автобус марки Mercedes, Man, Neoplan, Setra,
							Yutong или аналог. Компания «Делимир-Вояж» не имеет возможности
							влиять на задержки, связанные с пробками на дорогах, действиями и
							мероприятиями государственных органов, в том числе органов ГИБДД,
							дорожными работами, а также на любые другие задержки, находящиеся
							вне разумного контроля фирмы. В случае тяжелой дорожной ситуации
							возможны поздние приезды на экскурсионные объекты, а также
							заселение в гостиницу.
						</span>
					</td>
					<td class="p-2 text-start align-top">Редактировать, удалить</td>
				</tr>
			</tbody>
		</table>
	</div>
	<!--/Card-->
</template>
